modules/User/Admin/WalletController.php

select * from `users` where `users`.`id` = '6' and `users`.`deleted_at` is null limit 1
---
    public function addCredit($user_id = ''){
        if(empty($user_id)){
            abort(404);
        }
        $row = User::find($user_id);

select * from `user_transactions` where `id` = 9 limit 1
select * from `users` where `users`.`id` = 6 and `users`.`deleted_at` is null limit 1
---
    public function reportBulkEdit(Request $request){

        $ids = $request->input('ids');
        $action = $request->input('action');
        if (empty($ids))
            return redirect()->back()->with('error', __('Select at lease 1 item!'));
        if (empty($action))
            return redirect()->back()->with('error', __('Select an Action!'));
        if ($action == 'delete') {
           foreach ($ids as $id) {
               if($id == Auth::id()) continue;
               $query = User::where("id", $id)->first();
               if(!empty($query)){
                   $query->email.='_d';
                   $query->save();
                   $query->delete();
               }
           }
        } else {
            foreach ($ids as $id) {
                switch ($action){
                    case "completed":
                        $payment = DepositPayment::find($id);
                        if($payment->payment_gateway == 'offline_payment' and $payment->status == 'processing'){
                            $payment->markAsCompleted();
                            //$payment->sendUpdatedPurchaseEmail();
                        }
                        $transaction = Transaction::where('id',$payment->wallet_transaction_id)->first();
                        $row = User::find($transaction->author_id);