modules/Booking/Controllers/BookingController.php

    protected function savePassengers(Booking $booking, Request $request)
    {
        $booking->passengers()->delete();
---
update `bravo_booking_passengers` set `deleted_at` = '2023-12-23 12:36:29', `bravo_booking_passengers`.`updated_at` = '2023-12-23 12:36:29' where `bravo_booking_passengers`.`booking_id` = 23 and `bravo_booking_passengers`.`booking_id` is not null and `bravo_booking_passengers`.`deleted_at` is null